{"id":"8da35a6b-9907-459b-ab25-e727ac99a8ad","name":"Primary","code":"N276","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0d28eea5-3983-4a3f-b004-1cfe6bcfd565","name":"Ladock","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a5c0ddff-ebc8-4fc0-aac0-07037a9bf400","name":"St Winnow","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0a5fd28f-11ff-4972-bda7-98cf1bd2f9f2","name":"St Petrocs","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1bb9e887-d730-4418-8b24-3c07f2ac2a0c","name":"Bishop Bronescombe","isPublished":"Y","status":"R","vacancies":"F"},{"id":"18c30e76-dcc4-4f40-9e0a-fbf685b1c687","name":"St Michael's Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"61e65996-6999-410b-966e-cd39f90366b4","name":"Grampound With Creed","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b8bc8017-5082-470e-ab1c-39057b1144f0","code":"HG8","name":"Celtic Cross Education"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct course is a demanding and intensive school- based course which will lead to a recommendation of Qualified Teacher Status (QTS) and a Postgraduate Certificate of Education (PGCE 5-11) accredited by Plymouth Marjon University. \r\n\r\nThe School Direct course is a thorough and effective way of training 'on the job', with less time spent in University and more time in the actual classroom. Trainees are able to benefit from this extra time by absorbing more of the excellent teaching practices around them, as well as being accepted as a member of teaching staff quickly. \r\n\r\nThe Primary (5-11) course aims to give participants experience of the full range of ages between 5 and 11 in two contrasting school placements. Trainees initially observe and wok with small groups, eventually leading to whole class teaching in two different schools. Trainees also benefit from taking part in three focus weeks based on SEND, Outdoor Education and Christian Distinctiveness. In addition, taught sessions will take place once or twice a week at Plymouth Marjon University where trainees will essentially be taught the academic requirements of the PGCE course. \r\nSchool Direct trainees on our programme will complete placements in two contrasting schools, teaching in different age phases at each one and within different sized and located schools. Placement schools will be chosen in discussion with trainees linked to preferences of location, size of school and any transport needs. \r\n\r\n\r\n \r\n","interviewProcess":"Our interviews are held in Celtic Cross Education partnership schools. The interviews are conducted by representatives from CCE and partnership schools. \r\n\r\nThe interview will consist of the following: \r\n\r\n•Activity with pupils \r\n\r\n•Formal interview \r\n\r\n•Written English test – piece of writing to assess written fluency and spelling, punctuation and grammar \r\n\r\n• Maths test \r\n\r\n•Opportunity to meet course leaders and ask questions about the training \r\n\r\nYou will only be asked to attend one selection day and candidates are informed of the outcome later that day. \r\n\r\n ","howSchoolPlacementsWork":"School Direct trainees on our programme will complete placements in two contrasting schools, teaching in different age phases at each one and within different sized and located schools. Placement schools will be chosen in discussion with trainees linked to preferences of location, size of school and any transport needs. \r\n\r\nTrainees will have two lead mentors, one at the lead placement school and a University based tutor to guide you through your year. Another mentor will be provided during your second shorter placement with the lead mentors overseeing the placement. During all three placements trainees will work closely with their class teachers and other teachers within the schools. \r\n\r\nAdditionally, trainees will also complete shorter placements within focus weeks, covering SEND, Outdoor Education and Church School Distinctiveness. These placements will take place in a wider number of CCE schools. \r\n\r\nCCE training is delivered in our schools and also at our Trust Training Centre led by Trust staff and specialist providers. \r\n\r\n ","personalQualities":"Being passionate about making a difference to the lives of children. \r\nA desire to teach and inspire. \r\nEnthusiasm about the curriculum with a subject specialism.  \r\nCreative and imaginative. \r\nThe ability to present information and communicate well verbally and in writing. \r\nStrong organisational skills. \r\nSense of humour and able to be a team player. ","otherRequirements":"Offers will be subject to a successful interview, as well as a Health Check Statement and an Enhanced Disclosure from the Disclosure and Barring Service. \r\n\r\nA good reference. \r\n\r\nRelevant experience in a primary school setting within the last twelve months is beneficial for your application but not essential. ","status":1,"createdAt":"2021-07-06T10:53:01.174Z","updatedAt":"2021-10-14T08:27:13.096Z","canSponsorStudentVisa":"yes","cycle":"2024"}
