{"id":"d532f056-c35f-43f4-8578-37c70ec0c93c","name":"Music","code":"G199","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"1a1d1f44-4b6c-4951-af3e-c48f9fe5e0f7","name":"MACMILLAN ACADEMY","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"455e2809-ec8a-4997-b89a-ba70ff8bdae8","code":"3K9","name":"Macmillan Academy Training School"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12750,"aboutCourse":"Macmillan Academy Training School and York St John University work in partnership to deliver high quality teacher education and training which leads to a PGCE qualification with QTS (Qualified Teacher Status).\r\nOur school-centred (School Direct) PGCE secondary programme is a community of learning with partnership at the heart of the programme.  \r\nThe programme delivers contemporary and highly relevant education and training which provides excellent opportunities for you to develop knowledge and understanding of your subject and wider educational issues. You will have the opportunity to teach practical and theory lessons across all key stages.  You will be equipped to become an outstanding teacher and leader with strong subject knowledge and a clear professional identity.  You will be supported by experts in both university and schools to ensure that you have opportunities to learn about current classroom practice and develop deep subject pedagogy.  The programme combines school experience with taught sessions on subject knowledge and pedagogy which occur at university and also in partnership schools. Two academic assignments will need to be passed so you meet the programme aims and gain the PGCE award.  These modules will underpin your own rigorous understanding of pedagogy and will provide you with 60 Masters level credits, which you may wish to use towards a full Masters qualification in the future.\r\nThe Macmillan Academy Training School PGCE School Direct programme is a full time programme studied within one academic year (September - June) and covers the 11- 16 age phase with 16-19 enhancement.  You will be based within one school for the majority of your training where you will complete two placements.  There is also a 6-week contrasting placement in a different partnership school, either in the autumn or spring term.  During these three placements, you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of your independent teaching.  Induction is a key part of the programme and each placement as we feel it is important for you to feel welcome in the school community and valued as members of staff from the start. You will attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.  \r\n","interviewProcess":"The recruitment process is rigorous and thorough. It is designed to enable Macmillan Academy Training School and York St John University to assess the suitability of candidates for training and to appoint the best candidates for the places available.  \r\n\r\nSelection is based on evidence given throughout the application process and includes:\r\n•\tYour personal statement\r\n•\tReferences\r\n•\tDetailed breakdown of degree content\r\n•\tDetails of other academic, professional or vocational qualifications\r\n•\tCompletion of a practical task at interview\r\n•\tOverall performance at interview\r\n\r\nInterview days take place in one of our partnership schools. Typical activities include a short teaching activity and an individual interview with a panel made up of Macmillan Academy Training School teaching school staff and university staff.  Candidates may also have an interview with a pupil panel and take part in a group activity and literacy-based task.\r\nPlaces on the programme are limited and recruitment takes place regularly during the year.  If you are successful at interview you will be offered a conditional place.  Once the number of offered places meets the agreed programme numbers, the programme will be closed.  We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.\r\n","howSchoolPlacementsWork":"The Macmillan Academy Training School PGCE School Direct programme is a full time programme studied within one academic year (September - June) and covers the 11- 16 age phase with 16-19 enhancement.  You will be based within one school for the majority of your training where you will complete two placements.  There is also a 6-week contrasting placement in a different partnership school, either in the autumn or spring term.  During these three placements, you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of your independent teaching.  Induction is a key part of the programme and each placement as we feel it is important for you to feel welcome in the school community and valued as members of staff from the start. You will attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.  This helps you to understand your own professional identity and be a fully committed member of a school community.","personalQualities":"We welcome applicants who are passionate about their subject and inspiring students to learn and develop key skills needed in our modern world.  We have an excellent track record of achievement in terms of successful completion rates and retention in teaching.  We believe that in order to thrive in initial teacher training trainees must be enthusiastic, reflective, organised, able to work independently and as part of a team and have excellent communication skills.  They must also demonstrate a genuine interest in both education and securing the best outcomes (academic and pastoral) for their students no matter their background or ability.","otherRequirements":"Disclosure and Barring Service (DBS)\r\nEntrants to the programme must undertake an enhanced DBS criminal records check. \r\n\r\nMedical Questionnaire\r\nAll entrants are expected to complete a medical questionnaire in order to assess your fitness to teach.  Medical questionnaires will be forwarded to successful interviewees.\r\n","status":1,"createdAt":"2021-07-06T10:48:19.275Z","updatedAt":"2021-09-21T07:47:06.620Z","canSponsorStudentVisa":"yes","cycle":"2024"}
