{"id":"0edfb3c9-4239-4cd8-8b27-d4a299b4c280","name":"Primary","code":"367M","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0be2bfe8-f54c-4ecc-a170-fccaeb6474ca","name":"William Shrewsbury Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"75b2d323-eff7-41d1-bfc2-b6ce3db8f6b9","code":"2FM","name":"William Shrewsbury Primary Partnership"},"accreditedBody":{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our programme is intensive, stimulating, thought provoking and challenging. It is based on the premise that all teachers should aspire to outstanding practice. \r\n\r\nThere are 6 distinct components to our training programme and each is explicitly linked, assuring that there is a coherence between the elements:\r\n1.\tInduction\r\n2.\tClassroom Practice \r\n3.\tProfessional Studies Training Modules (Professional Studies, Barriers to Learning)\r\n4.\tSubject Knowledge Development Modules (English, Maths and Wider Curriculum)\r\n5.\tSchool Based Tasks \r\n6.\tMasters Level study \r\n\r\nProfessional Studies Programme\r\n\r\nThe Training Centre at John Taylor High School will be the main venue for much of the Professional Studies training, although we deliver some of the programme here at William Shrewsbury  as well as other local primary schools in the Central Co-operative Learning Trust to enable you to develop theory alongside practice. We have worked collaboratively  to design and deliver truly outstanding and exciting school based training programmes. During these sessions trainees come together to develop their curriculum and subject knowledge for teaching, look at professional issues relevant to all teachers such as inclusion, safeguarding, behaviour management and pastoral care as well as pedagogical themes including assessment for learning and differentiation. Professional Studies training generally takes place on a Friday and will provide an opportunity for you to mix with other trainees from our programmes.\r\n\r\nPrimary Subject Knowledge Programme\r\n\r\nAlongside pedagogical themes, a significant proportion of your training will involve the development of your curriculum and subject knowledge for teaching. There will be an appropriate focus on the core subjects of English and Maths, but we feel that it is equally important to develop your confidence to teach the wider curriculum effectively.\r\n\r\nMasters in Teaching and Learning\r\n\r\nAlongside your QTS you will be accredited with a PGCE with 60 Masters Level credits. The academic side of the programme will be accredited by the University of Derby. The credits are fully portable and can be used on other Master's level programmes, subject to the agreement of the receiving university. There will be three assignments over the year, which will be closely linked with the QTS training programme and are designed to support you in becoming effective classroom practitioners. You will have full access to the University of Derby Library and VLE to support you, all university input will take place in the Training Centre at John Taylor High School.","interviewProcess":"Our normal practice is to carry out interviews at William Shrewsbury Primary School.* This will consist of several parts which are designed to assess your literacy and numeracy skills, interactions with children and your awareness of the qualities required needed to be a good teacher.  It will also assess your understanding of what constitutes high quality teaching and learning in primary schools, interpersonal and communication skills, awareness of educational issues, your rationale for wanting to become teacher, suitability for the profession and your resilience.\r\n\r\n\r\n*Interviews may take place online due to current Covid-19 restrictions.","howSchoolPlacementsWork":"You will be based at a William Shrewsbury Primary Partnership school as your home school placement where  you will begin and end your training.  Please see the CCLT (Central Co-operative Learning Trust) website https://www.centralclt.com/  to see our partner schools. Following a period of induction in the SCITT you will spend the majority of your time in the classroom developing effective classroom pedagogy. Through a structured programme of observation, joint planning and joint delivery of lessons you will gradually build up to whole class teaching. You will work alongside outstanding practitioners and will be supported by highly trained mentors, all of whom are committed to ensuring the very best experience and outcomes for their trainees.\r\n\r\nAfter Christmas you will undertake a shorter second placement in another school. This is an opportunity to learn within a different school context and through exposure to a new range of teaching and learning strategies develop your practice further. We think that it is important also that you develop a broad understanding of education in different contexts extending beyond your subject and so before you return to your home school to complete your training year, we offer enhanced placement opportunities in a special school.\r\n\r\nAllocation to the second placement will include a contrasting key stage so that all stages of the primary curriculum are covered throughout the training year. It is important that trainees have experience of 2 contrasting school contexts and experiences a school presenting a degree of challenge.\r\n","personalQualities":"We are looking for highly motivated trainees with a real passion and commitment to ensuring the very best outcomes for every child, regardless of their starting points. Enthusiasm and a desire to inspire and motivate young people are essential qualities in all applicants. Successful trainees will be expected to reflect on and evaluate their progress and practice in the classroom, identifying ways to improve and always willing to take advantage of professional development opportunities. We require our trainees to be good team players, who listen as well as contribute and who have an appreciation of the strength of collaboration. ","otherRequirements":"* DBS\r\nApplicants must have successfully gained a Disclosure and Barring Service (DBS) check, which is completed no more than three months before starting the programme.\r\n\r\n* Fitness to Teach\r\nAll applicants will be asked to complete a document in which we will evaluate their mental and physical capacity to train to teach.\r\n\r\n*At interview all applicants will  be assessed with regard to their literacy and numeracy.\r\n","status":1,"createdAt":"2021-07-06T10:47:41.661Z","updatedAt":"2021-10-13T08:50:31.355Z","canSponsorStudentVisa":"no","cycle":"2024"}
