{"id":"25a5097a-2b1a-437a-924a-38f3fe13827a","name":"Primary","code":"K280","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ea611abd-a0ef-4b39-be72-ed53ff9a253a","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3b4f5907-5855-4960-819c-eae7b426a589","code":"18E","name":"Hales Valley Teaching Hub"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Once individuals have accepted a place, they can then make applications for tuition fee loans through Student Finance England, to cover the cost of their training. ","aboutCourse":"This course will give you the skills and understanding needed to successfully meet the needs of children in the classroom.\r\n\r\nThe course will begin in September 2021 and last for one academic year with a trainees time being divided between school based placements  and structured training days, workshops and group discussions which will take place at either Birmingham City University or Hales Valley Teaching Hub and focus upon key educational theory and practice. \r\n\r\nThe setting of this course also provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic and cultural backgrounds. While the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds of the course spent in school.\r\n\r\nThis course is practical and very hands-on in its approach.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\n\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"School direct is a school-led training course which gives you the chance to learn ‘on the job’ in a school. You work as part of the teaching team from day one, learning from experienced, highly-skilled colleagues and you immediately put your new skills into practice.\r\n\r\nYou will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in different schools. You will gain direct teaching experience and work with experienced practitioners in the classroom. You will be placed within one of our 22 partnership schools. You will be assigned a trained mentor while on placement, who will support and guide your work, as well as provide training and feedback.\r\n\r\nWe have worked very closely with our partnership schools over the last seven years and have excellent relationships with them. They share our ethos, understanding the importance and value of school led teacher training.\r\n\r\nYou will have two school experiences throughout the year ensuring you gain experience in both EYFS and key stage 1 enabling you to teach 3-7 year olds.  You spend your first and last school experience in the same class, in the same school. Your second school placement is in different school ensuring you gain a wider experience in your training. \r\n\r\nYou also spend time in Key Stage 2 in order to gain experience of both the key stage above where you will be qualified to teach. \r\n","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training Criteria, which includes being fit to train to teach, to successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding check required for your course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":2,"createdAt":"2021-07-06T10:55:20.502Z","canSponsorStudentVisa":"yes","cycle":"2024"}
