{"id":"6628ab43-2112-43bd-9806-69c828bfa9d3","name":"Geography","code":"HJ89","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"9038937c-1adc-4a8c-8d26-6f9427777915","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"6cf33842-f1c4-49cf-8697-3ba1a2cd6c45","code":"2KH","name":"All Saints RC School"},"accreditedBody":{"id":"3117eaa6-b483-49de-92a2-ee4ead1b0903","code":"Y50","name":"The University of York"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Overseas / EU students are classified as international students for fee purposes, as per government regulations.\r\n\r\n\r\n","aboutCourse":"This course will prepare you to teach effectively at KS3 and KS4 (11-16), specialising in your subject area. During your PGCE, you will get to grips with up-to-date thinking and the latest research in teaching and learning. You'll benefit from our expertise as a leading centre for curriculum development, professional training and research.\r\n\r\nTrainees come to the course with a range of qualifications, employment backgrounds and interests. Throughout the course you will be encouraged to work collaboratively, sharing your experience, knowledge and technical expertise. Activities emphasise teamwork and require you to share the responsibility for your learning.\r\n\r\nThroughout the course, you will be guided by mentors in your placement schools and supported by your university tutors.\r\n\r\nSchool experience forms the backbone of the PGCE course and a large proportion of the training year is spent in placement schools. Trainees will complete a one week primary school placement at the start of the course, a two-day per week placement in the first half term, plus two five week teaching placement blocks in their first placement school and a ten week block teaching placement in a second school.\r\n\r\nTrainees complete three Masters-level written assignments (one per term) during the PGCE course on themes such as lesson observation and teaching evaluation. This course is worth 60 Masters-level credits (each module is worth 20 credits), which you can put towards a Masters degree through accreditation for prior credited learning (APCL). The practical teaching requirements and formal written assignments are designed not just to provide evidence that trainees have reached the required Teachers' Standards but also as useful learning activities in themselves. Assessment is continuous, across all aspects of the course.\r\n\r\nOur secondary PGCE programmes prepare trainees to teach across the 11-16 age range. As part of the Post-16 Enhancement we offer trainees a range of experiences to develop their knowledge, understanding and skills for teaching at Post 16.\r\nIn its most recent evaluation, the Office for Standards in Education (Ofsted) awarded our PGCE programme a Grade 2: Good.\r\n\r\nThe Department of Education is located in Derwent College, on the west part of our Heslington campus. Your university sessions will take place in a variety of locations around campus. School placements usually take place in York, although some may be further afield.\r\n","interviewProcess":"All shortlisted applicants will be invited to attend a selection process. \r\n\r\nThe selection process comprises of a range of activities including: \r\n\r\n- a briefing on the course structure\r\n- a short presentation regarding how you would use an item or artefact to enhance learning in a secondary classroom\r\n- a written task to test your subject knowledge\r\n- an individual panel interview \r\n\r\nYou will be interviewed by members of the PGCE team from the University and colleagues from partner organisations (e.g. current and former teachers, local authority partners, etc.) Full details of the selection arrangements will be supplied to all candidates invited to interview.\r\n","howSchoolPlacementsWork":"School experience forms the backbone of the PGCE course and a large proportion of the training year is spent in placement schools. Trainees will complete a week's primary school placement at the start of the course, a two day per week placement in the first term plus two continuous teaching placement blocks in their first placement secondary school (each about five weeks) and a continuous block teaching placement in a different secondary school from February to May. There is also a two week placement in June.\r\n\r\nOf the four school placement opportunities described above, two are teaching placements and occur in contrasting secondary schools. These two teaching placements offer opportunities to learn from experienced teachers and hone your professional skills. You'll spend time observing and supporting lessons, before moving on to teach lessons by yourself, building up to a 50% teaching timetable by the end of your first secondary placement.\r\n\r\nIn your second teaching placement school you'll take responsibility for teaching classes, supervised by an experienced teacher. You'll gain experience teaching students of different ages and abilities, helping with assessment, coursework and examinations, as well as parents' evenings and school outings.\r\n\r\nOver the two placements you'll have opportunities to observe, plan, teach and assess pupils at a wide range of attainment in Key Stage 3 and 4. You'll also get some post-16 experience in at least one of your teaching placement schools.\r\n\r\nYou'll be expected to get involved in wider school life by, for example, working as a form tutor, taking part in meetings, contributing to extracurricular activities and communicating with parents and carers.\r\n","personalQualities":"During our recruitment of PGCE candidates, we are looking for applicants who demonstrate a genuine passion for entering the teaching profession, an awareness of current education issues and enthusiasm for their subject. We are also looking for people who have excellent communication skills (spoken and written) and who are organised, reflective and adaptable.","otherRequirements":"In addition to the academic entry requirements, all PGCE candidates will be required to: \r\n\r\n- Obtain an enhanced DBS check (plus overseas police checks for any countries where 12 months or more have been spent in the last ten years)\r\n- Complete an occupational health check\r\n- Meet the Department of Education's English Language requirements (international students only) \r\n\r\nWe may ask you to complete a Subject Knowledge Enhancement course as a condition of your offer.","status":1,"createdAt":"2021-07-06T10:47:46.594Z","updatedAt":"2021-07-21T20:19:31.734Z","canSponsorStudentVisa":"yes","cycle":"2024"}
