{"id":"c628d97c-a393-4a9e-9dd3-e0940edc9c4f","name":"Physical Education","code":"AE62","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"9038937c-1adc-4a8c-8d26-6f9427777915","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6cf33842-f1c4-49cf-8697-3ba1a2cd6c45","code":"2KH","name":"All Saints RC School"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Overseas / EU students are classified as international students for fee purposes, as per government regulations.","aboutCourse":"All Saints RC School and York St John University work in partnership to deliver high quality teacher education and training which leads to a PGCE qualification with QTS (Qualified Teacher Status). Our school-centred (School Direct) PGCE secondary programme is a community of learning with partnership at the heart of the programme.  The partnership works together to develop outstanding student teachers who are transformative and creative professionals, highly motivated and committed, autonomous and independent, enquiry based practitioners and self-reflective practitioners. The programme delivers contemporary and highly relevant education and training which provides excellent opportunities for you to develop knowledge and understanding of your subject and wider educational issues.  You will be equipped to become an outstanding teacher and leader with strong subject knowledge and a clear professional identity.  You will be supported by experts in both university and schools to ensure that you have opportunities to learn about current classroom practice and develop deep subject pedagogy.  The programme combines school experience with taught sessions on subject knowledge and pedagogy which occur at university and also in partnership schools. Two academic assignments will need to be passed so you meet the programme aims and gain the PGCE award.  These modules will underpin your own rigorous understanding of pedagogy and will provide you with 60 Masters level credits, which you may wish to use towards a full Masters qualification in the future.\r\n\r\nThe programme ensures that you fulfil the requirements of the current Teachers’ Standards for the award of QTS. The programme encourages you to engage critically with educational issues to enable you to develop as a reflective practitioner, with the ability to evaluate and adapt your practice to meet the diverse needs of pupils in secondary schools.  This is achieved through a range of learning, teaching and assessment strategies, including active learning and enquiry-based learning, which is considered essential in both modelling effective learning and teaching practice.\r\n\r\n","interviewProcess":"The recruitment process is designed to enable All Saints RC School and York St John University to assess the suitability of candidates for training and to appoint the best candidates for the places available.  \r\n\r\nSelection is based on evidence given throughout the application process and includes:\r\n•\tYour personal statement\r\n•\tReferences\r\n•\tDetailed breakdown of degree content\r\n•\tDetails of other academic, professional or vocational qualifications\r\n•\tCompletion of a practical task at interview\r\n•\tOverall performance at interview\r\n\r\nInterview days take place in one of our partnership schools. Typical activities include a short teaching activity and an individual interview with a panel made up of teaching school staff and university staff.  Candidates may also have an interview with a pupil panel and take part in a group activity and literacy-based task.\r\n\r\nPlaces on the programme are limited and recruitment takes place regularly during the year.  If you are successful at interview you will be offered a conditional place.  Once the number of offered places meets the agreed programme numbers, the programme will be closed.  We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.\r\n","howSchoolPlacementsWork":"The All Saints RC School PGCE School Direct programme is a full time programme studied within one academic year (September - June) and covers the 11- 16 age phase with 16-19 enhancement.  You will be based within one school for the majority of your training where you will complete two placements.  There is also a 6-week contrasting placement in a different partnership school, either in the autumn or spring term.  During these three placements, you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of your independent teaching.  Induction is a key part of the programme and each placement as we feel it is important for you to feel welcome in the school community and valued as members of staff from the start. You will attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.  This helps you to understand your own professional identity and be a fully committed member of a school community.","personalQualities":"We are looking for trainees with an enthusiasm not just for their subject, but to teach it to pupils in the secondary age range and who have some recent knowledge and understanding of secondary education.  Successful trainees are those who combine this enthusiasm with an ability to organise planning, teaching and classroom management, reflect on their training experience, develop as critical professionals, integrate their teaching approach and delivery with cross curricular initiatives, express ideas clearly and succinctly, show personal initiative, have a love of learning and can communicate all of this to pupils and students in their care.","otherRequirements":"Disclosure and Barring Service (DBS): Entrants to the programme must undertake an enhanced DBS criminal records check. \r\n\r\nMedical Questionnaire: All entrants are expected to complete a medical questionnaire in order to assess your fitness to teach.  Medical questionnaires will be forwarded to successful interviewees.\r\n","status":1,"createdAt":"2021-07-06T10:47:46.355Z","updatedAt":"2021-07-21T20:30:35.253Z","canSponsorStudentVisa":"yes","cycle":"2024"}
