{"id":"e042e3f7-97b2-4341-8871-fb9eb79ec643","name":"Computing","code":"V552","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"9038937c-1adc-4a8c-8d26-6f9427777915","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"6cf33842-f1c4-49cf-8697-3ba1a2cd6c45","code":"2KH","name":"All Saints RC School"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":11000,"aboutCourse":"This is an innovative, flexible, two-year part-time training programme aimed at those with family commitments and IT professionals who are ambitious to train in the classroom but need the flexibility to remain in work.\r\n\r\n\r\nThere are two options for study:\r\n\r\n\r\n1: Train two days per week each year and then complete a full-time teaching practice of 8 weeks at the end of year two in term 5 and 6 (finishing in June). \r\n\r\n\r\n2: Train two days per week throughout year one then 3 days per week in year two (finishing in June). \r\n\r\n\r\nBoth options cost £5,500 each year. \r\n\r\n\r\nOver two years, trainees will have more than 120 days in school. Professional learning days are included in the training days, although there may be an occasional day when Trainees are required to attend an event such as an Employment conference. Subject knowledge days will be delivered in twilight sessions. \r\n\r\n\r\nOur hybrid approach to learning combines traditional classroom experiences and digital course delivery, all taught by practising teachers. \r\n\r\n\r\nThe course covers curriculum design, development of teaching materials, planning classroom activities and classroom management. Trainees will work with tutors and fellow trainees to develop innovative and exciting ways of delivering your knowledge of computing in the 11-16 context with post-16 enhancements. \r\n\r\nAt KS3 the computing programme of study is divided into information technology, digital literacy and computer science. We will investigate each strand, emphasising the computational thinking skills that are common to all three. \r\n \r\nMost schools in England deliver computer science at GCSE. We will build on your subject knowledge, giving you the confidence to teach and possibly to lead in this fast-growing subject.\r\n\r\nThere is a national shortage of teachers who can deliver post-16 computer science  qualifications. One of the aims of this course is to introduce the programming paradigms required at A-level, in particular in the delivery of the NEA programming project. \r\n\r\nAs a computing trainee you will have additional training from the National Centre for Computing Education (NCCE), whose Computer Science GCSE Accelerator programme is integrated into the course. As well as receiving your QTS, you will obtain a professionally recognised training certificate, awarded by BCS, The Chartered Institute for IT. The part-time computing course is QTS-only as this programme has extra subject knowledge input and more focus on practical teaching application.\r\n\r\n","interviewProcess":"For the foreseeable future, interviews will be held virtually. Interviews are conducted by representatives from All Saints and partnership schools.\r\n\r\nYou will be given the opportunity to meet course leaders. \r\n\r\nWhen it is possible to access schools freely, we shall ask that you conduct a pupil activity and complete a written English test.","howSchoolPlacementsWork":"When allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n\r\nAll trainees undertake two main placements. The first placement runs from the first day of the Autumn Term until December. The second placement, in a contrasting school environment, runs from January until late June. \r\n\r\nTrainees will also take part in mini placements across the year, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.\r\n\r\nYou'll be expected to get involved in wider school life by, for example, working as a form tutor, taking part in meetings, contributing to extracurricular activities and communicating with parents and carers.","personalQualities":"- Passionate about making a difference to the lives and development of young people\r\n\r\n- Independent, resilient and adaptable\r\n\r\n- Friendly and approachable, with the ability to engage young people\r\n\r\n- Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n\r\n- Creative and imaginative\r\n\r\n- Good organisational skills and excellent time management skills\r\n- Reflective and strive to improve their own practice\r\n\r\n- High standards of spoken and written English\r\n\r\n- Demonstrate a professional attitude\r\n\r\n- Have made a considered and informed decision to train to teach","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n\r\nAdmission is dependent upon satisfactory medical examination conducted by the Accrediting Body's preferred supplier. \r\n\r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n\r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. ","status":1,"createdAt":"2021-07-12T13:48:12.800Z","updatedAt":"2021-07-21T20:36:30.779Z","canSponsorStudentVisa":"no","cycle":"2024"}
