{"id":"f7476965-f41a-4459-8853-4c9045ae2d0d","name":"Music","code":"P654","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"f15ce9ef-f413-404d-b37d-c8b1fe1dd027","name":"Haberdashers' Borough Academy","isPublished":"Y","status":"R"},{"id":"cafe1ab6-7dfe-447b-8918-a6b64a7c1e8b","name":"Main Site","isPublished":"Y","status":"R"},{"id":"27e9089f-d3b4-4d4c-9f3f-64214e1134a5","name":"Haberdashers' Knights Academy","isPublished":"Y","status":"R"},{"id":"e679a6db-1ef3-4238-b542-b1a608f99600","name":"Haberdashers' Hatcham College","isPublished":"Y","status":"R"},{"id":"fb2d86e2-6172-4d64-aaba-fcd98965ceb5","name":"Haberdashers' Crayford Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"54e32479-0d46-4127-8de7-ed286416e683","code":"1KP","name":"Haberdashers’ Academies Trust South"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you need to undertake equivalency tests as part of your offer please visit : (https://astarequivalency.co.uk/)","courseLength":"OneYear","feesUK":null,"aboutCourse":"This one-year programme will see you placed in two of our Trust schools as an integral member of the school team, developing your skills alongside experienced professionals while accessing additional support from our subject experts and your designated in-school mentor.\r\n\r\nYou will spend four days per week gaining practical, in-school experience, gradually taking on lessons and shared responsibility for pupils. Your remaining day will be dedicated to study with our partner, Tes Institute. Their award-winning blended learning programme will allow you to develop core professional and pedagogical skills while strengthening your subject knowledge.\r\n\r\nYour studies will predominantly be carried out on an innovative e-learning platform, through which you will gain 24/7 access to course materials, lessons and tutorials, making learning extremely flexible. You will also be able to participate in an exciting programme of face-to-face workshops and specialist teaching visits to contextualise your training.\r\n\r\nAll of our courses lead to QTS with the additional option of adding on a PGCE. There is no extra application process for the PGCE route. Should you wish to pursue this option, you can express this to us at interview stage.\r\n\r\nIn order to obtain QTS, you will be required to complete two higher education assessments of upwards of 3,000 words throughout the year. Applicants on the PGCE route will need to complete three.\r\n\r\nExample assignment topics include:\r\n\r\n* The Teaching of a Foundation Subject\r\n* Technology Enhanced Learning\r\n* Subject Knowledge Development\r\n\r\n\r\nIn addition to these formal assessments, you will continuously work on completing the tasks and objectives laid out in your Training Plan. This document will act as a structured record of your learning and professional development, providing evidential support for your application for QTS.","interviewProcess":"This will determine your suitability to train to teach and assess your literacy and numeracy skills and subject knowledge.\r\n\r\nThe assessment process will include a presentation, a panel interview, a group task and a short teaching demonstration.","howSchoolPlacementsWork":"You will complete two placements in contrasting schools within our Trust.\r\n\r\nYour first and main placement will last approximately one academic year.\r\n\r\nThe second placement lasts six weeks and takes place during the Spring Term.","personalQualities":"We are looking for applicants with a genuine passion for teaching and a commitment to working as part of a school community to make a difference to the lives of children in South East London.\r\n\r\nSuccessful applicants are:\r\n\r\n* resilient and reflective\r\n* highly organised and driven\r\n* adaptable and open to new opportunities\r\n* motivated to further their own development\r\n* able to demonstrate high levels of personal initiative\r\n* secure in their subject knowledge\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:31.925Z","updatedAt":"2021-09-03T14:18:48.197Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Your salary will be calculated using the unqualified teachers’ pay scales."}
