{"id":"688118dd-1e5d-436b-a63e-f6e03b187a47","name":"Primary with Mathematics","code":"GFHF","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"e3cb02da-3e12-4808-a912-5fb4b6ff17fd","name":"St Mary's Primary School, High Green","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3e070a22-fe23-4f91-ab15-cd132e712636","name":"Highgate Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4775a094-7bd2-4ffc-a49e-2e493c4c487e","name":"Dobcroft Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"660b3769-f8f8-487b-b7aa-f2d8efa38c15","name":"Hunters Bar Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69787ca1-a05c-401b-b485-80da4bb64747","name":"St Thomas More Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"68d33377-5110-454d-ba5a-c61bf90ea151","name":"Our Lady and St Joseph's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"73861055-fc8c-47b4-85f8-166b591d0de1","name":"St Joseph's Catholic Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5d527c7d-6ca3-4c67-9c58-91268c8ba0d7","name":"St Patrick's Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"86394511-9ada-4854-96e7-20ae2e672be0","name":"Mundella Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7534b7f9-69b8-4999-a008-2702e5e1d836","name":"St Ann's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f3863459-cdfb-4a32-9945-d1154fd41db0","name":"Our Lady of Sorrows Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1b91a206-d2fb-475c-9bc2-5ee60e0d74da","name":"St Catherine's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d189b196-8260-45fe-8cf1-aeee2c020d41","name":"St Marie's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency. \nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs.  \nIn addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":7850,"feeDetails":"There are  Student Loans available to pay the fees. \r\n\r\nIf you decide to pay privately then the payment schedule is\r\n\r\n* Term 1 : £2,000\r\n* Term 2 : £2,000\r\n* Term 3 : £3,850\r\n\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course. \r\n\r\n","financialSupport":"We are not able to offer any monetary financial support to trainees.  However,\r\n\r\n* We will support you with the Student Finance Application process. \r\n* We will keep you informed as to whether you are eligible for a government funded Train to Teach Bursary. \r\n* We will also make you aware of any national scholarships that may be available for the subject you are training to teach. \r\n* We also provide free membership to the Westfield Healthy Extras emotional wellness support package to support you during your ITT year. \r\n ","aboutCourse":"The Sheffield SCITT is committed to providing quality first teacher training. We continually develop and review our programme of study to make it current and relevant. \r\n\r\nThis course will entail 4 days in school. During time in school you will be guided by an experienced mentor. One day per week you will join other teacher trainees. You will receive high quality training on all aspects of the Teacher Standards including: teacher presence and behaviour management, planning and teaching effective lessons, and how to really stretch and challenge students. \r\n\r\nThere are three formally assessed teaching practices throughout the year. You will begin, and spend the majority of the year, in your ‘Home School’ and there will be the opportunity to complete one teaching practice in a contrasting primary school, in an alternate Key Stage.\r\n\r\n","interviewProcess":"The interview process for the SCITT involves a formal interview, questions from a subject specialist and a 15 minute teaching activity. We also ask you to sit mock numeracy and literacy papers to help us identify if you will need support to pass your skills tests. We also ask you to reflect on your teaching activity.","howSchoolPlacementsWork":"You will spend most of the training year in your Home School and these schools are central to the selection process and our school based interview system. You can express a preference for your Home School based on location, preference for the type of school or a personal connection to a community you want to serve but we cannot guarantee to meet everyone's preference.\r\n\r\nThere is also a short alternative placement in a contrasting alliance school in the middle of the training year and a brief experience in the phase (primary or secondary) you are not training to teach in. It would be sensible for trainees to base themselves within commutable distance of their Home School so these are finalised with you before the summer holidays to allow you to arrange your accommodation. We make every attempt to make sure the alternative placement school is in an accessible location but it may involve a few weeks of travelling further to get that all important contrasting experience in the right school for you.\r\n","personalQualities":"We are looking for the next generation of outstanding teachers and future school leaders. They will be passionate about children and education but also care about our schools and the communities they serve and the special ethos each of those schools have.\r\n\r\nThey will have experience of working with young people - ideally some of this will be school based giving them a good awareness of how schools operate and teachers work.  Whatever their experience our applicants need to demonstrate how they have engaged, communicated with and inspired the young people they have worked with. ","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. \r\nIdeally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc.\r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen or have been granted \"settled Status\" by the U.K. Home Office.\r\nIf you are not a UK citizen you will need to prove you have access to Public Funds or have the ability to support yourself financially during your course prior to being offered a place.","status":1,"createdAt":"2021-07-06T10:52:37.253Z","updatedAt":"2021-10-04T11:03:14.224Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
