{"id":"dc2a670b-3a3f-4aad-82ad-58168c92896d","name":"Mathematics","code":"JIM8","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"004aff84-2fa9-49ca-a11f-50cc07f41fb4","name":"UTC Sheffield","isPublished":"N","status":"S","vacancies":"F"},{"id":"8efbb585-af43-457e-bb3e-bdee37cc2cf0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c5e5b22-ea1d-4922-b68f-f8b99f6649c3","name":"All Saints Catholic High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"cf0bd611-ea2d-4eab-88c9-33ba636cb449","name":"McCauley Catholic High School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If your degree is not in the subject you want to train to teach then you will need to either have an A level in the subject you want to teach or be able to demonstrate sufficient subject knowledge during the interview. \nWe know that many people apply to us while they are still completing their undergraduate degree. If you are in this situation it is important that at least one of the people who provide you with a reference is someone who can provide an academic reference from your university. This reference will need to contain a prediction of your degree class.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency.\nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs.\nIn addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September","courseLength":"OneYear","feesUK":7850,"feeDetails":"There are  Student Loans available to pay the fees. \r\n\r\nIf you decide to pay privately then the payment schedule is\r\n\r\n* Term 1 : £2,000\r\n* Term 2 : £2,000\r\n* Term 3 : £3,850\r\n\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course. \r\n\r\n","financialSupport":"We are not able to offer any monetary financial support to trainees.  However,\r\n\r\n* We will support you with the Student Finance Application process. \r\n* We will keep you informed as to whether you are eligible for a government funded Train to Teach Bursary. \r\n* We will also make you aware of any national scholarships that may be available for the subject you are training to teach. \r\n* We also provide free membership to the Westfield Healthy Extras emotional wellness support package to support you during your ITT year. \r\n ","aboutCourse":"The Sheffield SCITT is committed to providing quality first teacher training. Our course exceeds the statutory requirements for Initial Teacher Training in all areas. You will be taught and supported by experienced classroom teachers. Your training will be informed throughout by the evidence base as to what makes the most effective teaching. \r\n\r\nThis course will entail 4 days a week in the classroom and one day per week receiving more formal training. \r\n\r\nDuring your time in the classroom you will work with and alongside experienced teachers to develop your own teaching practice. You will receive personalised support and be guided by an experienced mentor. \r\n\r\nOne day per week you will join other teacher trainees. You will be trained on aspects such as how to walk and talk like a teacher, plan lessons effectively, behaviour management and how to really stretch and challenge students.\r\n\r\nYou will spend September to December in your ‘Home School’. From December to Easter you will have the opportunity to experience life in a contrasting secondary school. From Easter to the end of the programme you will return to your initial school. \r\n\r\n","interviewProcess":"The interview process for the SCITT involves a formal interview, questions from a subject specialist and a 15 minute teaching activity. \r\nWe also ask you to sit mock numeracy and literacy papers to help us identify if you will need support before you start your ITT course. \r\nWe also ask you to reflect on your teaching activity.","howSchoolPlacementsWork":"You will spend most of the training year in your Home School and these schools are central to the selection process and our school based interview system. You can express a preference for your Home School based on location, preference for the type of school or a personal connection to a community you want to serve but we cannot guarantee to meet everyone's preference.\r\n\r\nThere is also a short alternative placement in a contrasting alliance school in the middle of the training year and a brief experience in the phase (primary or secondary) you are not training to teach in. It would be sensible for trainees to base themselves within commutable distance of their Home School so these are finalised with you before the summer holidays to allow you to arrange your accommodation. We make every attempt to make sure the alternative placement school is in an accessible location but it may involve a few weeks of travelling further to get that all important contrasting experience in the right school for you.\r\n","personalQualities":"We are looking for the next generation of outstanding teachers and future school leaders. They will be passionate about children and education but also care about our schools and the communities they serve and the special ethos each of those schools have.\r\n\r\nThey will have experience of working with young people - ideally some of this will be school based giving them a good awareness of how schools operate and teachers work.  Whatever their experience our applicants need to demonstrate how they have engaged, communicated with and inspired the young people they have worked with. ","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. \r\nIdeally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc.\r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen or have been granted \"Settled Status\" by the U.K. Home Office.\r\nIf you are not a UK citizen you will need to prove you have access to Public Funds or have the ability to support yourself financially during your course prior to being offered a place. ","status":1,"createdAt":"2021-07-06T10:52:37.564Z","updatedAt":"2021-09-24T08:18:20.822Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
