{"id":"17881325-128f-4a28-9e61-38f58e56388f","name":"Physical Education","code":"3B8B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"ffc7df1e-6df3-4547-b6ce-5f3a93c21b40","name":"Woldgate School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"965d27c0-e543-4729-91d5-65f039c4662f","code":"2HT","name":"The Wonder Training School"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Contact us to discuss...","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is not a confirmed fee.","aboutCourse":"Our School Direct Secondary PE course is all about turning your passion for sport and exercise into a rewarding career as a teacher. The extensive school-based  experience will help you develop your understanding of practical teaching strategies to inspire your pupils through physical activity and games. This learning is combined with a wide range of theoretical techniques explored with academic tutors, giving you the skills to manage a variety of teaching scenarios.\r\n\r\nLeeds Beckett is an established sports education provider with a rich sporting pedigree. Your skills and knowledge will be nurtured in a supportive learning community with vast experience of training the next generation of PE teachers. Your network of support will include our research staff and course tutors, who will be on hand to sharpen your teaching expertise and knowledge of the subject, ensuring it is informed by the latest research and practices.\r\n\r\nYou will have access to our wide range of first-class sporting facilities - used by international athletes and Olympic medal winners - to help you in the practical application of your theoretical learning. These include 3G pitches, indoor and floodlit outdoor tennis courts, an athletics track, a swimming pool and gyms packed with the latest fitness equipment.\r\n\r\nYou will develop your communication skills so that you can confidently manage a large group of pupils, understanding the importance of varying your tone of voice during group activities, using equipment such as whistles appropriately and learning how to address and maintain the attention of your pupils when teaching PE.\r\n\r\nYou will also develop the skills to confidently manage classes with wide differences in ability. You will be able to devise lessons that develop from personalised activities to games that involve and stimulate your entire class.\r\n\r\nOur School Direct course is a school-led training programme which combines practical in-school training with theoretical research-based studies undertaken at Leeds Beckett University. We are convinced that the supportive, personalised in-school training delivered by our partnership schools, combined with the academic challenge provided by experienced university tutors, nurtures excellent new teachers who are ready and eager for the excitement of a fulfilling teaching career.\r\n\r\nFor the vast majority of the course, you will be based in a partnership school or schools, learning on the job while being supported by experienced teachers and mentors. You will usually attend the Leeds Beckett Headingley Campus one day a week for key module seminars.","interviewProcess":"The interview process will consist of a short presentation, a written task and a panel interview. The panel will be made up of three Partnership members of staff. ","howSchoolPlacementsWork":"Trainees have 120 days of teaching experience.\r\nSchool placements are arranged in our partnership schools and you will usually have two placements in contrasting settings: a main placement and a second. These will be selected based on travel distance and your interests and emerging talents. At least one of the placements will be in an 11-18 setting.","personalQualities":"We are keen to hear from prospective trainees who share our people-centred approach and we will be looking for these qualities:\r\n\r\n* Enthusiasm for your subject and for working with young people\r\n* A genuine love of learning that you want to share with others\r\n* Initiative and creativity\r\n* A clear desire to help children grow intellectually and as individuals\r\n* Resilience\r\n* Strong communication skills","otherRequirements":"The Learning Partnership is committed to safeguarding and promoting the welfare of young people and expects all members of staff to share this commitment. An enhanced DBS disclosure is required for all posts.","status":1,"createdAt":"2021-07-06T10:47:18.923Z","updatedAt":"2021-10-05T12:16:16.416Z","canSponsorStudentVisa":"yes","cycle":"2024"}
