{"id":"1f7d297e-6056-458d-a8de-aa855f628cda","name":"Geography","code":"3B8C","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"ffc7df1e-6df3-4547-b6ce-5f3a93c21b40","name":"Woldgate School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"965d27c0-e543-4729-91d5-65f039c4662f","code":"2HT","name":"The Wonder Training School"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Contact us to discuss...","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is not a confirmed fee.","aboutCourse":"Our School Direct Secondary Geography course involves extensive school-based experience which will help you develop your understanding of practical teaching strategies to inspire your pupils by bringing geography to life. The classroom learning is combined with a wide range of theoretical techniques explored with academic tutors, giving you the skills to manage a variety of teaching scenarios. \r\n\r\nYour subject learning will cover two main strands involving an enquiry-based approach to geography and real-world practical activities, which you will then translate into your classroom lessons. You will be taught how to use a range of geographical resources through practical tasks, including maps and atlases, photographs and images, meteorological equipment, geographical media and cultural artefacts. You will develop your understanding of key geographical practical resources and equipment and how they are used, which will enable you to then enhance your pupils' learning.\r\n\r\nYou will have the opportunity to participate in and lead outdoor field experiences which will investigate physical and human geography. These experiences will develop your understanding of how to infuse classroom-based learning with practical outdoor sessions. Your training will also involve exploring key issues in geography such as migration, war and sustainability, enabling you to develop a better understanding of these modern issues which you will then translate into a classroom context and ensuring your teaching is current.\r\n\r\nOur School Direct course is a school-led training programme which combines practical in-school training with theoretical research-based studies undertaken at Leeds Beckett University. We are convinced that the supportive, personalised in-school training delivered by our partnership schools, combined with the academic challenge provided by experienced university tutors, nurtures excellent new teachers who are ready and eager for the excitement of a fulfilling teaching career.\r\n\r\nFor the vast majority of the course, you will be based in a partnership school or schools, learning on the job while being supported by experienced teachers and mentors. You will usually attend the Leeds Beckett Headingley Campus one day a week for key module seminars.\r\n\r\n\r\n​\r\n","interviewProcess":"The interview process will consist of a short presentation, a written task and a panel interview. The panel will be made up of three Partnership members of staff. ","howSchoolPlacementsWork":"Trainees have 120 days of teaching experience.\r\nSchool placements are arranged in our partnership schools and you will usually have two placements in contrasting settings: a main placement and a second. These will be selected based on travel distance and your interests and emerging talents. At least one of the placements will be in an 11-18 setting.","personalQualities":"We are keen to hear from prospective trainees who share our people-centred approach and we will be looking for these qualities:\r\n\r\n* Enthusiasm for your subject and for working with young people\r\n* A genuine love of learning that you want to share with others\r\n* Initiative and creativity\r\n* A clear desire to help children grow intellectually and as individuals\r\n* Resilience\r\n* Strong communication skills","otherRequirements":"The Learning Partnership is committed to safeguarding and promoting the welfare of young people and expects all members of staff to share this commitment. An enhanced DBS disclosure is required for all posts.","status":1,"createdAt":"2021-07-06T10:47:18.962Z","updatedAt":"2021-10-05T12:14:51.984Z","canSponsorStudentVisa":"yes","cycle":"2024"}
