{"id":"65318296-0ee3-49da-96fb-06a4ae29c265","name":"Primary","code":"3B8D","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ffc7df1e-6df3-4547-b6ce-5f3a93c21b40","name":"Woldgate School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"965d27c0-e543-4729-91d5-65f039c4662f","code":"2HT","name":"The Wonder Training School"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is not a confirmed fee.","aboutCourse":"Train to be a primary school teacher through our School Direct programme and enjoy a rewarding career teaching children aged between five and 11 years. We will build your knowledge and teaching ability so that you can become a confident and inspiring practitioner, with the ability to spark children's imaginations and learning.\r\n\r\nThis course will provide training in all primary stage National Curriculum subjects, with a particular focus on the core subjects of English, mathematics and science. You will explore established educational theories alongside new ideas, concepts and developments in the field of education. Rigorous academic study on campus will be complemented by a range of practical teaching experiences to really enhance your professional development.\r\n\r\n\r\nOur School Direct course is a school-led training programme which combines practical in-school training with theoretical research-based studies undertaken at Leeds Beckett University. We are convinced that the supportive, personalised in-school training delivered by our partnership schools, combined with the academic challenge provided by experienced university tutors, nurtures excellent new teachers who are ready and eager for the excitement of a fulfilling teaching career.\r\n\r\nFor the vast majority of the course, you will be based in a partnership school or schools, learning on the job while being supported by experienced teachers and mentors. You will usually attend the Leeds Beckett Headingley Campus one day a week for key module seminars.\r\n","interviewProcess":"The interview process will consist of a short presentation, a written task and a panel interview. The panel will be made up of three Partnership members of staff. ","howSchoolPlacementsWork":"Trainees have 120 days of teaching experience.\r\nSchool placements are arranged in our partnership schools and you will usually have two placements in contrasting settings: a main placement and a second. These will be selected based on travel distance and your interests and emerging talents. ","personalQualities":"We are keen to hear from prospective trainees who share our people-centred approach and we will be looking for these qualities:\r\n\r\n* Enthusiasm for your subject and for working with young people\r\n* A genuine love of learning that you want to share with others\r\n* Initiative and creativity\r\n* A clear desire to help children grow intellectually and as individuals\r\n* Resilience\r\n* Strong communication skills","otherRequirements":"The Learning Partnership is committed to safeguarding and promoting the welfare of young people and expects all members of staff to share this commitment. An enhanced DBS disclosure is required for all posts.","status":1,"createdAt":"2021-07-06T10:47:18.995Z","updatedAt":"2021-10-05T12:16:46.336Z","canSponsorStudentVisa":"yes","cycle":"2024"}
