{"id":"9a30373c-7528-4f40-87e1-f1be7993d4d7","name":"Drama","code":"V586","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"02573a06-2e21-4b59-b3ce-5793cbca018c","name":"Longcroft School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"965d27c0-e543-4729-91d5-65f039c4662f","code":"2HT","name":"The Wonder Training School"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our School Direct course is all about turning your passion for your subject into a rewarding career as a teacher. The extensive school-based experience will help you develop your understanding of practical teaching strategies to inspire your pupils by bringing your subject to life. This classroom learning is combined with a wide range of theoretical techniques explored with academic tutors, giving you the skills to manage a variety of teaching scenarios.\r\n\r\nYou will learn to ignite your pupils’ interest in your subject. You will learn how to select appropriate materials to match the different abilities and level of understanding of your class and how to use creative techniques, so pupils understand how to create pieces of work that inspire them and you! \r\n\r\nOur School Direct course is a school-led training programme which combines practical in-school training with theoretical research-based studies undertaken at the University of Hull. We are convinced that the supportive, personalised in-school training delivered by our partnership schools, combined with the academic challenge provided by experienced university tutors, nurtures excellent new teachers who are ready and eager for the excitement of a fulfilling teaching career.\r\n\r\nFor the vast majority of the course, you will be based in a partnership school or schools, learning on the job while being supported by experienced teachers and mentors. You will usually attend the University of Hull campus at the start of the school year, but then, by October half term – you’ll be in school learning on the job, sharing your passion for your subject with our children and preparing for the wonderful world of being a teacher! ","interviewProcess":"The interview process will consist of a short presentation, a written task and a panel interview. The panel will be made up of three Partnership members of staff. ","howSchoolPlacementsWork":"Trainees have 120 days of teaching experience.\r\nSchool placements are arranged in our partnership schools and you will usually have two placements in contrasting settings: a main placement and a second. These will be selected based on travel distance and your interests and emerging talents. At least one of the placements will be in an 11-18 setting.","status":1,"createdAt":"2021-10-14T19:38:33.059Z","updatedAt":"2021-10-14T19:39:39.152Z","canSponsorStudentVisa":"yes","cycle":"2024"}
