{"id":"663984c6-a252-4985-a33a-1a27f2bd7eaf","name":"Postgraduate Primary Teaching Apprenticeships","code":"3FJM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3cea8927-5395-4626-ade0-1904fd604070","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"e43bdebc-5157-4418-9196-bcb9cc39e758","code":"18Y","name":"Grazebrook Primary School"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"\r\nThe Postgraduate Teaching Apprenticeship is a nationally recognised, work-based route into teaching; an alternative to a traditional full-time university course, offering participants a postgraduate-level qualification, no tuition fees, and the opportunity to earn while they learn.\r\n\r\nTeaching apprentices have achieved very achieve highly: in its first year of running, our trainees were all graded Outstanding in their teaching practice and almost all gained distinctions in the academic work. All have continued in employment in their schools. This exciting and  challenging route is the perfect preparation for your career in teaching. \r\n\r\nAs an apprentice, you'll work mostly in one school, where you will be employed on the  unqualified teacher rate. You will also undertake another placement in a contrasting setting and key stage, giving you a variety of hands-on experience. You will have 20% guaranteed off the job training, split between university days and school-based training tasks.\r\n\r\nThis is a Level 6 (degree level) course leading to Qualified Teacher Status (QTS). Our apprentices also undertake a Level 7 (Master’s Level) PGCE. This structure gives you room to develop your classroom practice and to examine the underlying principles and values around education. This course has two modules designed to help you develop an understanding of your future role as a primary school teacher:\r\n\r\n•\tThe Curriculum Studies module introduces you to the issues of teaching within urban, multicultural and multilingual schools. You'll address the challenges of language, diversity and equality across the curriculum and learn how to teach core subjects including English, Mathematics and Science. \r\n\r\n•\tThe Professionalism and Inclusive Practice (PIP) module gives you an understanding of the broader contexts and a framework for meeting the needs of all the children you'll teach, linking to the United Nations Convention on the Rights of the Child (UNCRC), \r\n\r\nThroughout your year, your school-based mentors and university tutors will support you in in the classroom. The latter will also teach your university sessions, ensuring there is continuity of support throughout your training. By working in both environments, you will reflect on the links between your own teaching theory and practice. \r\n\r\nLMU training is highly rated by Ofsted, who praised the 'inclusive, welcoming and open ethos and culture created by course leaders. Combined with the tailored and personalised support apprentices receive, which enables them to successfully complete their training and confidently go on to gain employment.' (Ofsted 2016)","interviewProcess":"Currently all initial interviews are undertaken online, via video link (Google Meet or similar). Later in the process there may be a face to face assessment prior to an offer being made.\r\n\r\nShortlisted applicants will be invited to a interview at the lead school and then with university tutors from the primary ITE team. The  online university interview will include an online diagnostic assessment of your basic maths and English skills.\r\n\r\nFurther details on the interview processes will be available after application.\r\n\r\nOnce you've undertaken both school  and university interviews, we will normally confirm the decision through UCAS within one week. If you're offered a place, we will additionally email you to confirm how to meet any conditions of your offer.\r\n\r\nIf you're unsuccessful at any stage the decision will be communicated through UCAS. We do try to indicate a reason in UCAS why we have not been able to offer a place and suggestions as to how you might work towards another application, more successfully.\r\n\r\nIf unsuccessful at this stage, you may also be offered an alternative route into teacher training from within the university portfolio.\r\n\r\nIf you have any queries relating to your application you should contact Liza Hooper at New Wave Teaching School for further information or the Admissions Office at London Met ITT@londonmet.ac.uk.\r\n","howSchoolPlacementsWork":"The Postgraduate Teaching Apprenticeship is a nationally recognised, work-based route into teaching. It is an alternative to a traditional full-time university course, offering participants a postgraduate-level qualification, no tuition fees, and the opportunity to earn while they learn.\r\n\r\nThe PGCE Early Years & Primary Apprenticeship route is a one-year course, which is both rewarding and demanding.\r\n\r\nThe training will occupy 20% of your teaching time, split between face-to-face training at the University (Holloway Road campus) and independent training tasks in the workplace. \r\n\r\nThe course will then build on these well established and successful foundations by combining the expertise of our course tutors (who are all experienced classroom practitioners and teacher trainers) with a dynamic curriculum designed to cater for your needs as a teacher apprentice. You will be encouraged to reflect upon your own practice and to critically engage with current research, policy and pedagogy, leading to the PGCE award with 60 master’s-level credits and Qualified Teacher Status (QTS). \r\n\r\nThe course is made up of 4 modules; two consecutive School Experience modules and two academic modules. \r\n\r\nApprentices  will be placed predominantly in one of our alliance schools for the majority of the academic year and will be supported  by an assigned mentor.\r\n\r\nAll apprentices will complete a 6 week alternative placement in another key stage in the spring term.\r\n\r\n\r\n","personalQualities":"We are looking for dynamic, energetic, enthusiastic and caring apprentices. \r\n\r\nAs a teacher you will need to be passionate and enthusiastic about your work and your specialism. \r\n\r\nYou will have a desire to share this and make a real difference to young people's lives and futures. Ideally, you:\r\n\r\n*\tare able to express why you want to teach.\r\n\r\n*\thave visited a local school in order to observe and gain experience of how teaching and learning is organised.\r\n\r\n*\thave participated on the School Experience Programme.\r\n\r\n*\tcan discuss current educational thinking e.g. The Times Educational Supplement.\r\n\r\n","otherRequirements":"The  interview process will include a series of tasks aimed at assessing your ability and appropriateness for the course. This will include a presentation, an individual interview and a series of online and hand-written tasks. Apprentices are subject to enhanced DBS checks and are required to make a declaration about any criminal convictions.\r\n\r\nIf you receive an offer, we will need to see all original documents before you are able to enrol. If you do not have original certificates, you should apply immediately for replacements. Without these it might prevent you from joining the course.\r\n","status":1,"createdAt":"2021-07-06T10:51:09.803Z","updatedAt":"2021-10-18T08:04:38.066Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
